src/cf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Закупочная</name>
      <description>Prix d'achat</description>
    </items>
    <items>
      <name>Розничная</name>
      <description>Prix de vente</description>
    </items>
    <items>
      <name>МинимальнаяЦенаПродажи</name>
      <description>Prix minimal</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗакрытиеФормы;
&НаКлиенте
Перем ВалютаДоИзменения; // валюта и курс, от которых пересчитываются цены при смене валюты
&НаКлиенте
Перем КурсДоИзменения;

#КонецОбласти

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма); 
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Если Объект.Ссылка.Пустая() Тогда 
		УстановитьВидЦеныПоДоговору();
		Если Не Объект.ВВалюте Тогда
			Объект.Валюта = РаботаСВалютами.ОсновнаяВалюта();
			Объект.КурсВалюты = 1;
			ЗаполнитьВалютуПоДоговору();
		КонецЕсли;
	иначе
		Если РаботаСДокументами.ПолучитьДокументыПоИмениПоОснованию("НалоговаяНакладная", Объект.Ссылка,
			Истина).Количество() > 0 Тогда
			// По реализации выписана налоговая накладная - документ только для просмотра
			ТолькоПросмотр = Истина;
		КонецЕсли;
		Если Объект.ВидЦен.Пустая() Тогда 
			УстановитьВидЦеныПоДоговору();
		Иначе
			ВидЦены = Объект.ВидЦен;
			РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
		КонецЕсли;
	КонецЕсли;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	ЕстьПравоЗаверениеЦен = РегистрыСведений.НастройкиПользователей.ЗаверениеЦен();
	ЗаполнитьСрокОплатыНаСервере();
	НастроитьФорму();
	УстановитьВидимостьВалюты();
	Если ЕстьПравоЗаверениеЦен Тогда
		ЗаполнитьПоследниеЦены();
	КонецЕсли;
	ЗаполнитьОстаткиНаСервере();    
	ЗаполнитьСуммыОплатыДолга();
	ЗаполнитьФинРезультат();
	КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подменю", Элементы.ТЧТовары.КоманднаяПанель);
	Если Не ТолькоПросмотр Тогда
		КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подбор", Элементы.ТЧТовары.КоманднаяПанель);
	КонецЕсли;
	РаботаСДокументами.ОграничитьВидимостьРеквизитовПоТипу(ЭтотОбъект, "ОператорПроизводства");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина);
	ОбновитьРезюме();
	ЗапомнитьВалюту();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = РаботаСДокументамиКлиент.КлиентуЗапрещеноОтгружать(Объект);
	Если Отказ Тогда Возврат; КонецЕсли;
	Отказ = Не СерииИРазмещениеКлиент.ПроверитьСоответствиеСерийТоварам(ЭтаФорма, Объект.ТЧТовары, Объект.ТЧСерии, ПараметрыЗаписи);
	РаботаСДокументамиКлиент.ПроверитьСуммуАвансовТоварногоДокумента(Объект, Отказ);
	Объект.ВидЦен = ВидЦены;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
	Если ЕстьПравоЗаверениеЦен Тогда
		ЗаполнитьПоследниеЦены();
	КонецЕсли;
	ЗаполнитьСрокОплатыНаСервере();
	ЗаполнитьОстаткиНаСервере();
	ЗаполнитьФинРезультат();
	УстановитьВидимостьВалюты();
	Резюме = ТекстРезюме(Объект);
	Если Не ПустаяСтрока(Резюме) Тогда
		Заголовок = Резюме;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	ПересчитатьСтрокиПоРежимуНДС();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
	УстановитьВидЦеныПоДоговору();
	ЗаполнитьСрокОплатыНаСервере();
	ВалютаПоДоговору();
	ОбновитьРезюме();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
	ВалютаПоДоговору();
	ОбновитьРезюме();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
	ВалютаПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьЦеныПоЗаказу(Команда)
	ПерезаполнитьЦеныПоЗаказуНаСервере();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	СерииИРазмещениеКлиент.УказатьСерии(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьСерии(Команда)
	ЗаполнитьСерииНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	ЗаполнитьОстаткиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыПоСуммеДокумента(Команда)
	ЗаполнитьПоОстаткамНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыВсеНезакрытые(Команда)
	ЗаполнитьПоОстаткамНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧЗачётАвансовОснованиеПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧЗачётАвансов.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.Основание);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекСтр.ВидЦены = ВидЦены;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	Для Каждого Инд Из Элементы.ТЧТовары.ВыделенныеСтроки Цикл
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(Инд);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
	ТекСтр = Элемент.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда Возврат КонецЕсли;
	Если Элемент.ТекущийЭлемент = Элементы.ТЧТоварыКоличество Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Не ЗначениеЗаполнено(ТекСтр.Упаковка);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
	Если ЕстьПравоЗаверениеЦен Тогда
		ЗаполнитьПоследниеЦеныСтроки(Элементы.ТЧТовары.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентНаценкиНаЦенуПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ТекСтр.Цена = ТекСтр.ЦенаЗакупкиПоследняя
		* (1 + ТекСтр.ПроцентНаценкиНаЦену / РаботаСДокументамиКлиентСервер.СтоПроцентов());
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(ТекСтр, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоследниеЦеныСтроки(ТекСтр)
	СтрСтруктура = РаботаСДокументамиКлиентСервер.ПреобразоватьСтрокуТаблицыВСтруктуру(ТекСтр, Объект);
	СтрСтруктура = ЗаполнитьПоследниеЦены(СтрСтруктура);
	ЗаполнитьЗначенияСвойств(ТекСтр, СтрСтруктура, "ЦенаЗакупкиПоследняя, ЦенаПродажиПоследняя, ПроцентНаценкиНаЦену");
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	ПараметрыПолученияДанных.Вставить("ВыводитьСерию",Истина);
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПартияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика",
		Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика);
	ПартииИРазмещениеКлиент.ВыбратьПартиюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект),
		ДанныеОтбора, , ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика, Клиент", Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика, Объект.Контрагент); 
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);	
	//УстановитьЦеныНаСервере();
	ЗаполнитьСрокОплатыНаСервере();
	КурсПоДатеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзExcel(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗагрузки",ЭтаФорма);
	Пар = Новый Структура("СоздаватьТовары",Ложь);
	ОткрытьФорму("Обработка.ЗагрузкаИзExcel.Форма.Форма",Пар,ЭтотОбъект,ЭтотОбъект.УникальныйИдентификатор,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСкидкаНаЦенуПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияДовоза(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда Возврат КонецЕсли;
	Если РезультатЗакрытия.Идентификатор = Неопределено Тогда
		Стр = Объект.ТЧТовары.Добавить();
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	Иначе
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(РезультатЗакрытия.Идентификатор);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(Стр, РезультатЗакрытия,, "КодСтроки");
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод,Объект,,,ВидЦены,ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыЗагрузки(Результат,ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ЗаполнитьИзExcelНаСервере(Результат);
	ЗаполнитьОстаткиНаСервере();
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно  

&НаСервере
Процедура УстановитьЦеныНаСервере()
	ВалютаДокумента = Новый Структура("Валюта, Курс", ?(Объект.ВВалюте, Объект.Валюта, Неопределено),
		РаботаСВалютамиКлиентСервер.КурсДокумента(Объект));
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.Дата, Объект.ЦенаВключаетНДС,
		Объект.Контрагент, ВалютаДокумента);
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЦеныПоЗаказуНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Основание) Тогда Возврат КонецЕсли;
	ТЗЗаказ = Объект.Основание.ТЧТовары.Выгрузить();
	// Заказ - в основной валюте, цены переводятся в валюту реализации по её курсу.
	Курс = РаботаСВалютамиКлиентСервер.КурсДокумента(Объект);
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		СтрЗаказ = ТЗЗаказ.Найти(Стр.КодСтроки, "КодСтроки");
		Если СтрЗаказ = Неопределено Тогда
			Стр.ВидЦены = Неопределено;
			Стр.Цена = 0;
			Стр.ЦенаSKU = 0;
		Иначе	
			Стр.ВидЦены = СтрЗаказ.ВидЦены;
			Стр.Цена = СтрЗаказ.Цена / Курс;
			Стр.ЦенаSKU = СтрЗаказ.ЦенаSKU / Курс;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерииНаСервере()
	СерииИРазмещение.ЗаполнитьСерииПоОстаткам(Объект,Объект.Контрагент);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ВсеНеоплаченные)
	РаботаСДокументами.ПолучитьАвансыДляЗакрытия(Объект, Истина, ВсеНеоплаченные);		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	//ВидЦены = ?(ЗначениеЗаполнено(Объект.Договор.ВидЦены),Объект.Договор.ВидЦены, Справочники.ВидыЦен.Розничная);
	ВидЦены = ?(ЗначениеЗаполнено(Объект.Контрагент.ТипЦены),Объект.Контрагент.ТипЦены, Справочники.ВидыЦен.Розничная);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
	Объект.ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(ВидЦены);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	Элементы.ТЧТоварыГруппаПоследниеЦены.Видимость = ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыВидЦены.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыЦена.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыСумма.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыПроцентСкидки.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыСуммаСкидки.ТолькоПросмотр = Не ЕстьПравоЗаверениеЦен;
	Элементы.ГруппаФинРезультат.Видимость = ЕстьПравоЗаверениеЦен;
	Элементы.ТЧТоварыЗаполнитьИзExcel.Доступность = Не ТолькоПросмотр;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФинРезультат()
	РаботаСДокументамиВызовСервера.ЗаполнитьФинРезультат(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	Объект.ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(ВидЦены);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
	ПересчитатьСтрокиПоРежимуНДС();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзExcelНаСервере(Мас)
	Объект.ТЧТовары.Очистить();
	Для Каждого Эл из Мас Цикл
		НС = Объект.ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Эл);
		НС.СтавкаНДС = НС.Номенклатура.СтавкаНДС;
		Если ЗначениеЗаполнено(НС.Номенклатура) Тогда 
			НС.Упаковка = НС.Номенклатура.Единица;
		КонецЕсли;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоследниеЦены(Знач Строка = Неопределено)
	РаботаСДокументами.ЗаполнитьПоследниеЦены(Объект, Строка);
	Возврат Строка;
КонецФункции

&НаСервере
Процедура ЗаполнитьСрокОплатыНаСервере()
	СрокОплаты = РаботаСДокументами.ПолучитьСрокОплаты(Объект.Контрагент,?(Объект.Ссылка.Пустая(),ТекущаяДата(),Объект.Дата));
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьСуммыОплатыДолга()     
		
		СуммаДолга = "0,00";        
		СуммаОплаты  = "0,00"; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчётыСПокупателями.ОбъектРасчётов КАК ОбъектРасчётов,
		|	ВзаиморасчётыСПокупателями.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчётыСПокупателями КАК ВзаиморасчётыСПокупателями
		|ГДЕ
		|	(ВЫРАЗИТЬ(ОбъектРасчётов КАК Документ.РеализацияТоваровУслуг)) = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",объект.Ссылка);  
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
	Если Выборка.Количество() = 0 Тогда иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов КАК ОбъектРасчётов,
		|	ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(, (ВЫРАЗИТЬ(ОбъектРасчётов КАК Документ.РеализацияТоваровУслуг)) = &Ссылка) КАК ВзаиморасчётыСПокупателямиОстатки";
		Запрос.УстановитьПараметр("Ссылка",объект.Ссылка); 
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		СуммаДолга = Строка(Выборка.Итог("Сумма"));        
		// Долг - в основной валюте, сумма документа в валюте переводится по его курсу.
		СуммаДокументаРегл = РаботаСВалютамиКлиентСервер.СуммаРегл(Объект.Сумма, РаботаСВалютамиКлиентСервер.КурсДокумента(Объект));
		СуммаОплаты  = Строка(СуммаДокументаРегл - Выборка.Итог("Сумма"));
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	МестоХранения = Объект.МестоХранения;
	Если Не ЗначениеЗаполнено(МестоХранения) Тогда
		МестоХранения = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	КонецЕсли;
	РегистрыНакопления.ТоварыВНаличии.ЗаполнитьОстаткиСтрок(Объект.ТЧТовары, МестоХранения);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокиПоРежимуНДС()
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
	КонецЦикла;
	Для Каждого Стр Из Объект.ТЧУслуги Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКоманду(Команда)
	КомандыТабличныхЧастейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Количество") Тогда
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоПодбору(Объект, ВыбранноеЗначение, , ВидЦены, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

// Заголовок формы: номер, продажа клиенту, у организации, дата. Суммы и срока оплаты
// в заголовке нет - они всегда видны в подвале формы.
//
// Параметры:
//  Документ - ДанныеФормыСтруктура, ДокументОбъект - данные документа
//
// Возвращаемое значение:
//  Строка - текст заголовка; пустая строка, пока контрагент не выбран
//
&НаКлиентеНаСервереБезКонтекста
Функция ТекстРезюме(Документ)

	Если Не ЗначениеЗаполнено(Документ.Контрагент) Тогда
		Возврат "";
	КонецЕсли;

	Шаблон = НСтр("ru = '№ %1 · Продажа: %2 · %3 · %4';
		|fr = '№ %1 · Vente : %2 · %3 · %4';
		|en = 'No. %1 · Sale: %2 · %3 · %4';
		|es = '№ %1 · Venta: %2 · %3 · %4'");

	Возврат СтрШаблон(Шаблон,
		ОбщегоНазначенияКлиентСервер.НомерНаПечать(Документ.Номер),
		Документ.Контрагент,
		Документ.Организация,
		Формат(Документ.Дата, "ДЛФ=D"));

КонецФункции

// Пересчитывает заголовок формы: пока контрагент не выбран - стандартный заголовок
// документа, дальше - резюме сделки. Номер документа живёт в свёрнутой группе
// «Нумерация», поэтому в заголовке полезнее видеть суть, а не реквизиты.
//
&НаКлиенте
Процедура ОбновитьРезюме()

	Резюме = ТекстРезюме(Объект);
	Если Не ПустаяСтрока(Резюме) Тогда
		Заголовок = Резюме;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Документ в валюте (docs/plans/multicurrency.md): флажок ВВалюте открывает валюту и курс, цены и суммы строк -
// в валюте документа, колонка СуммаРегл - в основной валюте.

&НаКлиенте
Процедура ВВалютеПриИзменении(Элемент)
	ПрежняяВалюта = Объект.Валюта;
	ПрежнийКурс = Объект.КурсВалюты;
	ВВалютеПриИзмененииНаСервере();
	ПослеСменыВалюты(ПрежняяВалюта, ПрежнийКурс);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
	ПослеСменыВалюты(ВалютаДоИзменения, КурсДоИзменения);
КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыПриИзменении(Элемент)
	// Цены остаются в валюте документа - меняются только суммы в основной валюте.
	ПослеСменыВалюты(Объект.Валюта, Объект.КурсВалюты);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьСуммуРеглСтроки(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьСуммуРеглСтроки(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуРеглСтроки(Стр)
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Стр.СуммаРегл = РаботаСВалютамиКлиентСервер.СуммаРегл(Стр.Сумма, РаботаСВалютамиКлиентСервер.КурсДокумента(Объект));
КонецПроцедуры

// Запоминает валюту и курс, от которых пересчитываются цены при следующей смене валюты.
//
&НаКлиенте
Процедура ЗапомнитьВалюту()
	ВалютаДоИзменения = Объект.Валюта;
	КурсДоИзменения = Объект.КурсВалюты;
КонецПроцедуры

// После смены валюты, курса или флажка: суммы в основной валюте и, если сменилась сама валюта, - вопрос
// о пересчёте цен строк из прежней валюты в новую.
//
// Параметры:
//  ПрежняяВалюта - СправочникСсылка.Валюты - валюта до изменения.
//  ПрежнийКурс - Число - курс до изменения.
//
&НаКлиенте
Процедура ПослеСменыВалюты(ПрежняяВалюта, ПрежнийКурс)
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	ЕстьСтроки = Объект.ТЧТовары.Количество() + Объект.ТЧУслуги.Количество() > 0;
	Если ПрежняяВалюта = Объект.Валюта Или Не ЕстьСтроки Или ПрежнийКурс <= 0 Тогда
		ЗапомнитьВалюту();
		Возврат;
	КонецЕсли;
	Текст = СтрШаблон(НСтр("ru = 'Пересчитать цены строк из %1 в %2 по курсу?';
		|fr = 'Convertir les prix des lignes de %1 en %2 au taux de change ?';
		|en = 'Convert line prices from %1 to %2 at the exchange rate?';
		|es = '¿Convertir los precios de las líneas de %1 a %2 al tipo de cambio?'"), ПрежняяВалюта, Объект.Валюта);
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПересчетеЦен", ЭтотОбъект, ПрежнийКурс);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПересчетеЦен(Ответ, ПрежнийКурс) Экспорт
	ЗапомнитьВалюту();
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	// Курсы - к основной валюте (для основной 1), поэтому цена в новой валюте = цена × прежний курс / новый курс.
	Коэффициент = ПрежнийКурс / РаботаСВалютамиКлиентСервер.КурсДокумента(Объект);
	Для Каждого ИмяТаблицы Из СтрРазделить("ТЧТовары,ТЧУслуги", ",") Цикл
		Для Каждого Стр Из Объект[ИмяТаблицы] Цикл
			Стр.Цена = Стр.Цена * Коэффициент;
			РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС, "Цена");
		КонецЦикла;
	КонецЦикла;
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	Модифицированность = Истина;
КонецПроцедуры

// Договор в валюте переводит документ в эту валюту; при смене валюты - вопрос о пересчёте цен.
//
&НаКлиенте
Процедура ВалютаПоДоговору()
	ЗаполнитьВалютуПоДоговору();
	ПослеСменыВалюты(ВалютаДоИзменения, КурсДоИзменения);
КонецПроцедуры

// Курс на новую дату документа.
//
&НаКлиенте
Процедура КурсПоДатеДокумента()
	Если Не Объект.ВВалюте Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьКурсНаДатуНаСервере();
	ПослеСменыВалюты(Объект.Валюта, Объект.КурсВалюты);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсНаДатуНаСервере()
	ЗаполнитьКурсНаДату();
КонецПроцедуры

&НаСервере
Процедура ВВалютеПриИзмененииНаСервере()
	Если Объект.ВВалюте Тогда
		ЗаполнитьКурсНаДату();
	Иначе
		Объект.Валюта = РаботаСВалютами.ОсновнаяВалюта();
		Объект.КурсВалюты = 1;
	КонецЕсли;
	УстановитьВидимостьВалюты();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	ЗаполнитьКурсНаДату();
	УстановитьВидимостьВалюты();
КонецПроцедуры

// Курс валюты документа на его дату из регистра КурсыВалют; курс не задан - нулевой курс и сообщение:
// документ без курса не запишется (РаботаСВалютами.ПроверитьВалютуДокумента), пока курс не введут вручную.
//
&НаСервере
Процедура ЗаполнитьКурсНаДату()
	Если Не Объект.ВВалюте Тогда
		Возврат;
	КонецЕсли;
	Курс = РаботаСВалютами.КурсВалюты(Объект.Валюта, Объект.Дата);
	Объект.КурсВалюты = Курс;
	Если Курс > 0 Тогда
		Возврат;
	КонецЕсли;
	Шаблон = НСтр("ru = 'Курс валюты %1 на %2 не задан (Казначейство - Курсы валют): укажите курс в документе.';
		|fr = 'Le taux de change de %1 au %2 n''est pas défini (Trésorerie - Taux de change) : indiquez le taux dans le document.';
		|en = 'The %1 exchange rate on %2 is not set (Treasury - Exchange rates): enter the rate in the document.';
		|es = 'El tipo de cambio de %1 al %2 no está definido (Tesorería - Tipos de cambio): indique el tipo en el documento.'");
	ТекстСообщения = СтрШаблон(Шаблон, Объект.Валюта, Формат(Объект.Дата, "ДЛФ=D"));
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КурсВалюты");
КонецПроцедуры

// Договор в валюте, отличной от основной, переводит документ в эту валюту.
//
&НаСервере
Процедура ЗаполнитьВалютуПоДоговору()
	// Документ с заполненными строками (ввод на основании, копирование) валюту не меняет: цены строк
	// остались бы в прежней валюте.
	Если Объект.ТЧТовары.Количество() + Объект.ТЧУслуги.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВалютаВзаиморасчётов");
	Если Не ЗначениеЗаполнено(ВалютаДоговора) Или ВалютаДоговора = РаботаСВалютами.ОсновнаяВалюта()
		Или ВалютаДоговора = Объект.Валюта Тогда
		Возврат;
	КонецЕсли;
	Объект.ВВалюте = Истина;
	Объект.Валюта = ВалютаДоговора;
	ЗаполнитьКурсНаДату();
	УстановитьВидимостьВалюты();
КонецПроцедуры

// Доступность валюты и курса, заголовки цен и сумм с валютой, колонка сумм в основной валюте.
//
&НаСервере
Процедура УстановитьВидимостьВалюты()
	ВВалюте = Объект.ВВалюте;
	Элементы.Валюта.Доступность = ВВалюте;
	Элементы.КурсВалюты.Доступность = ВВалюте;
	Элементы.ТЧТоварыСуммаРегл.Видимость = ВВалюте;
	Элементы.ТЧУслугиСуммаРегл.Видимость = ВВалюте;
	// Оплата и долг читаются из взаиморасчётов - в основной валюте.
	ОсновнаяВалюта = РаботаСВалютами.ОсновнаяВалюта();
	ТекстОплачено = НСтр("ru = 'Оплачено'; fr = 'Payé'; en = 'Paid'; es = 'Pagado'");
	ТекстДолг = НСтр("ru = 'Долг'; fr = 'Dette'; en = 'Debt'; es = 'Deuda'");
	Элементы.СуммаОплаты.Заголовок = ?(ВВалюте, РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстОплачено, ОсновнаяВалюта),
		ТекстОплачено);
	Элементы.СуммаДолга.Заголовок = ?(ВВалюте, РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстДолг, ОсновнаяВалюта),
		ТекстДолг);
	ТекстЦена = НСтр("ru = 'Цена'; fr = 'Prix'; en = 'Price'; es = 'Precio'");
	ТекстСумма = НСтр("ru = 'Сумма'; fr = 'Montant'; en = 'Amount'; es = 'Importe'");
	Если ВВалюте Тогда
		ЗаголовокЦена = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстЦена, Объект.Валюта);
		ЗаголовокСумма = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, Объект.Валюта);
	Иначе
		// Пустой заголовок - заголовок по реквизиту.
		ЗаголовокЦена = "";
		ЗаголовокСумма = "";
	КонецЕсли;
	ЗаголовокСуммаРегл = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, РаботаСВалютами.ОсновнаяВалюта());
	Для Каждого ИмяТаблицы Из СтрРазделить("ТЧТовары,ТЧУслуги", ",") Цикл
		Элементы[ИмяТаблицы + "Цена"].Заголовок = ЗаголовокЦена;
		Элементы[ИмяТаблицы + "Сумма"].Заголовок = ЗаголовокСумма;
		Элементы[ИмяТаблицы + "СуммаРегл"].Заголовок = ЗаголовокСуммаРегл;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
